loadtesting/load_testing.yml
config:
  target: 'https://themedsense.com'
  http:
    - tls:
      - rejectUnauthorized: false
  phases:
    - duration: 60
      arrivalRate: 25
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - post:
        url: "/api/login"
        body: "username='ervin', password='12345678a'"
    - post:
        url: "/api/fetchGameById"
        body: "id: '5aaf22ee784e65302ce0a94a'"